
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда		
		ЗаполнитьНаОснованииРеализацииТоваровУслуг(ДанныеЗаполнения);		
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииРеализацииТоваровУслуг(ДанныеЗаполнения)
	
	Договор = ДанныеЗаполнения.Договор;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Организация = ДанныеЗаполнения.Организация;
	Основание = ДанныеЗаполнения.Ссылка;
	
	Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
		НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
	КонецЦикла;
	
КонецПроцедуры

